#Задание 1.1
#Пользователь вводит два числа, надо от первого числа отнять второе и вывести результат.
#Пример. Входные данные: 1 и 5. Вывод «1-5 = -4»

n1 = int(input())
n2 = int(input())
x = n1 - n2
print(x)
