##Пользователь вводит цифры по одной до тех пор, пока не введёт «3».
# Если пользователь ввёл 3-ку, то выписать «Конец» и закончить выполнение программы.
n = int (input())
while n != 3:
    n = int (input())
print("Конец")
#пока n не равно 3 цикл будет выполнятся, пока мы не введем 3
