#Пользователь вводит 3 числа через запятую.
# Надо вывести сумму этих всех чисел на экран.
n1, n2, n3 = map(int, input().split(","))
print(n1 + n2 + n3)
